In [2]:
import sqlite3

In [3]:
con= sqlite3.connect("students1.sqlite3") #database ko naam dya

In [4]:
cur= con.cursor() #select haru comment chalna lai. cur vanya chai cursor variable

In [7]:
CREATE_TABLE_QUERY="""

CREATE TABLE student(
id int primary key,
name varchar not null,
address varchar not null,
college varchar not null,
age int not null,
gender varchar(1) not null,
faculty varchar not null
);

"""
cur.execute(CREATE_TABLE_QUERY)

OperationalError: table student already exists

In [8]:
INSERT_RECORDS='''
INSERT INTO student
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty')
VALUES
(1, 'ram', 'ktm', 'ncit', 18, 'm', 'IT'),
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT'),
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE'),
(4, 'sita', 'ktm', 'ioe', 24, 'f', 'CE');
'''
cur.execute(INSERT_RECORDS)

IntegrityError: UNIQUE constraint failed: student.id

In [9]:
con.commit()

In [10]:
students= cur.execute("SELECT * from student;")
print(students)

<sqlite3.Cursor object at 0x000002823E90F140>

In [11]:
students= cur.execute("SELECT * from student;")
for student in students:
    print(student)

(1, 'ram', 'ktm', 'ncit', 18, 'm', 'IT')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT')
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE')
(4, 'sita', 'ktm', 'ioe', 24, 'f', 'CE')

In [12]:
students= cur.execute("""SELECT * from student where address= 'lalitpur';""")
for student in students:
    print(student)

(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT')

In [13]:
address= input("Enter your address:")
students= cur.execute(f"""SELECT * from student where address= '(address)';""")
for student in students:
    print(student)

Enter your address: ktm

In [14]:
#f string use garyo vane sql injection vayera database hack huncha
address= input("Enter your address please")
students= cur.execute(f"""SELECT * from student where address= '(address)';""")
for student in students:
    print(student)

Enter your address please kt m

In [2]:
#SELECT * from student where address= 'lalitpur' or address='kathmandu'

In [16]:
address= input("Enter your address please")
students= cur.execute("""SELECT * from student where address=?;""", (address,))
for student in students:
    print(student)

Enter your address please ktm

(1, 'ram', 'ktm', 'ncit', 18, 'm', 'IT')
(4, 'sita', 'ktm', 'ioe', 24, 'f', 'CE')

In [6]:
students= cur.execute(f"""alter table student add column university varchar default 'TU';""")
con.commit()

OperationalError: duplicate column name: university

In [10]:
student=(11, 'ramesh pradhan', 'lalitpur', 'ncit', 23, 'm', 'IT', 'TU')
INSERT_RECORDS= """
INSERT into student
("id", "name", "address", "college", "age", "gender", "faculty", "university")
values
(?,?,?,?,?,?,?,?);
"""
cur.execute(INSERT_RECORDS, student)

con.commit()

IntegrityError: UNIQUE constraint failed: student.id

In [9]:
students=[
    (8, "hari bahadur", "lalitpur","ncit",23,"m", "SE", "PU"),
    (9, "madan bahadur", "kathmandu","british college",24,"m", "IT", "UK"),
    (10, "maya devi", "lalitpur","ncit",21,"f", "CE", "PU"),
]
for student in students:
    INSERT_RECORDS= """
    
    INSERT into student
    ("id", "name", "address", "college", "age", "gender", "faculty", "university")
    values
    (?,?,?,?,?,?,?,?);
    
    """
    cur.execute(INSERT_RECORDS, student)
    
    con.commit()

In [12]:
#bulk write use garda dherei data ekaichoti halna milcha
students=[
    (113, "hari bahadur", "lalitpur","ncit",23,"m", "SE", "PU"),
    (114, "madan bahadur", "kathmandu","british college",24,"m", "IT", "UK"),
    (115, "maya devi", "lalitpur","ncit",21,"f", "CE", "PU"),
]
INSERT_RECORDS= """
    
INSERT into student
("id", "name", "address", "college", "age", "gender", "faculty", "university")
values
(?,?,?,?,?,?,?,?);
    
"""
cur.executemany(INSERT_RECORDS, students)  #insert at once=>bulk data
con.commit()